# Pandas

* filtering
* sorting
* usefull methods
* groupby
* merge

In [28]:
import pandas as pd
from datetime import datetime

# defines the data as a list of dictionaries with 10 student records

students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Mathematics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Computer Science', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# create the DataFrame

students_df: pd.DataFrame = pd.DataFrame(students_data)

# convert `date_of_admission` to datetime

students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# show the DataFrame

display(students_df)

# Verify the data types

display(students_df.info())

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            10 non-null     int64
 1   name               10 non-null     object
 2   father             10 non-null     object
 3   course             10 non-null     object
 4   date_of_admission  10 non-null     datetime64[ns]
 5   fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

None

In [29]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# define the schema using schema model

class StudentSchema(pa.DataFrameModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)
    
    class Config:
        coerce = True     # Automatically coerce types if possible
        strict = True     # Ensure all columns are accounted for in the schema
        
# data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# create the dataframe
students_df = pd.DataFrame(students_data)

# convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# validate the dataframe

validated_df = StudentSchema.validate(students_df)

print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

## Apply the filter or filter functions on dataframe

In [30]:
students_df.head(1)

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [31]:
students_df.course.value_counts()

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [32]:
students_df.course.value_counts(dropna=False)    # also counts null cell values

course
Physics      3
Chemistry    1
Biology      1
Economics    1
History      1
Geography    1
English      1
Art          1
Name: count, dtype: int64

In [33]:
students_df.course.value_counts(dropna=False, normalize=True)    # also counts null cell values

course
Physics      0.3
Chemistry    0.1
Biology      0.1
Economics    0.1
History      0.1
Geography    0.1
English      0.1
Art          0.1
Name: proportion, dtype: float64

In [34]:
students_df.course.value_counts(dropna=False, normalize=True)*100    # also counts null cell values

course
Physics      30.0
Chemistry    10.0
Biology      10.0
Economics    10.0
History      10.0
Geography    10.0
English      10.0
Art          10.0
Name: proportion, dtype: float64

In [35]:
students_df

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    Physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [36]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# set a seed for reproducibility

np.random.seed(0)

# define the number of transactions

num_trancsactions = 1000

# generate random dates within the current year

current_year = datetime.now().year
strat_date = datetime(current_year, 1, 1)
end_date = datetime.now()

# generate a list of random dates within the year

random_dates = [strat_date + timedelta(days=np.random.randint(0, (end_date - strat_date).days)) for _ in range(num_trancsactions)]

# generate a list of random fee accounts

random_fees = np.random.randint(low=0, high=5000, size=num_trancsactions)

# create the dataframe

fee_transactions = pd.DataFrame({
    'date': random_dates,
    'fee': random_fees
})

# sort by date for readability

fee_transactions.sort_values('date', inplace=True)

# reset index after sorting

fee_transactions.reset_index(drop=True, inplace=True)

print(fee_transactions)

          date   fee
0   2025-01-01  4277
1   2025-01-01  2170
2   2025-01-01  4327
3   2025-01-01  2256
4   2025-01-01  1124
..         ...   ...
995 2025-06-19  3049
996 2025-06-20  4785
997 2025-06-20  1186
998 2025-06-20  3211
999 2025-06-20  2093

[1000 rows x 2 columns]

In [37]:
pd.cut(fee_transactions.fee, [1, 500, 1000, 3000, 4000, 5000])

0      (4000, 5000]
1      (1000, 3000]
2      (4000, 5000]
3      (1000, 3000]
4      (1000, 3000]
           ...
995    (3000, 4000]
996    (4000, 5000]
997    (1000, 3000]
998    (3000, 4000]
999    (1000, 3000]
Name: fee, Length: 1000, dtype: category
Categories (5, interval[int64, right]): [(1, 500] < (500, 1000] < (1000, 3000] < (3000, 4000] < (4000, 5000]]

In [38]:
pd.cut(fee_transactions.fee, [1, 500, 1000, 3000, 4000, 5000]).value_counts()

fee
(1000, 3000]    428
(3000, 4000]    201
(4000, 5000]    185
(1, 500]        106
(500, 1000]      80
Name: count, dtype: int64

In [39]:
pd.cut(fee_transactions.fee, [1, 500, 1000, 3000, 4000, 5000]).value_counts(normalize=True)*100

fee
(1000, 3000]    42.8
(3000, 4000]    20.1
(4000, 5000]    18.5
(1, 500]        10.6
(500, 1000]      8.0
Name: proportion, dtype: float64

In [40]:
pd.qcut(fee_transactions.fee, [0.3, .5, .7, .9, 1])

0        (3479.5, 4438.2]
1      (1529.199, 2396.5]
2        (3479.5, 4438.2]
3      (1529.199, 2396.5]
4                     NaN
              ...
995      (2396.5, 3479.5]
996      (4438.2, 4997.0]
997                   NaN
998      (2396.5, 3479.5]
999    (1529.199, 2396.5]
Name: fee, Length: 1000, dtype: category
Categories (4, interval[float64, right]): [(1529.199, 2396.5] < (2396.5, 3479.5] < (3479.5, 4438.2] < (4438.2, 4997.0]]

In [41]:
pd.qcut(fee_transactions.fee, [0.3, .5, .7, .9, 1]).value_counts()

fee
(1529.199, 2396.5]    200
(2396.5, 3479.5]      200
(3479.5, 4438.2]      200
(4438.2, 4997.0]      100
Name: count, dtype: int64

In [42]:
pd.qcut(fee_transactions.fee, [0.3, .5, .7, .9, 1]).value_counts(normalize=True)*100

fee
(1529.199, 2396.5]    28.571429
(2396.5, 3479.5]      28.571429
(3479.5, 4438.2]      28.571429
(4438.2, 4997.0]      14.285714
Name: proportion, dtype: float64

In [43]:
students_df.head()

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
1        2  Brian  Steve  Chemistry        2023-02-12  11000
2        3  Chloe    Tim    Biology        2023-03-14  12000
3        4  David   Rick    Physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000

## filter on cloumns

* $, |, ~ Syntax

dataframe[(dataframe.column1='value1') & (dataframe.column2='value2')]

* string columns
* numeric columns
* datetime columns

In [44]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# define the schema using schema model

class StudentSchema(pa.DataFrameModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)
    
    class Config:
        coerce = True     # Automatically coerce types if possible
        strict = True     # Ensure all columns are accounted for in the schema
        
# data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# create the dataframe
students_df = pd.DataFrame(students_data)

# convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# validate the dataframe

validated_df = StudentSchema.validate(students_df)

print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [45]:
students_df.head(10)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

In [46]:
students_df['course'] == 'Physics'

0     True
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [47]:
students_df[students_df['course'] == 'Physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
4        5    Eva   John  Physics        2023-05-16  14000

In [48]:
students_df['course'].str.lower() == 'physics'

0     True
1    False
2    False
3     True
4     True
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [49]:
students_df[students_df['course'].str.lower() == 'physics']

   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000
3        4  David   Rick  physics        2023-04-10  13000
4        5    Eva   John  Physics        2023-05-16  14000

In [50]:
students_df['course'].str.lower().str.contains('cs')

0     True
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [52]:
students_df[students_df['course'].str.lower().str.contains('cs')]

   roll_no   name father     course date_of_admission    fee
0        1  Alice    Bob    Physics        2023-01-10  10000
3        4  David   Rick    physics        2023-04-10  13000
4        5    Eva   John    Physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [53]:
students_df[(students_df['course'].str.lower().str.contains('cs')) & (students_df['fee'] >= 14000)]

   roll_no   name father     course date_of_admission    fee
4        5    Eva   John    Physics        2023-05-16  14000
5        6  Frank    Tom  Economics        2023-06-21  15000

In [54]:
students_df['course'].str.lower().str.contains('cs') & students_df['course'].str.lower().str.contains('r')

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: course, dtype: bool

In [55]:
students_df['course'].str.lower().str.contains('cs') | students_df['course'].str.lower().str.contains('r')

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8    False
9     True
Name: course, dtype: bool

In [56]:
students_df[students_df['course'].str.lower().str.contains('cs') | students_df['course'].str.lower().str.contains('r')]

   roll_no   name   father     course date_of_admission    fee
0        1  Alice      Bob    Physics        2023-01-10  10000
1        2  Brian    Steve  Chemistry        2023-02-12  11000
3        4  David     Rick    physics        2023-04-10  13000
4        5    Eva     John    Physics        2023-05-16  14000
5        6  Frank      Tom  Economics        2023-06-21  15000
6        7  Grace    Harry    History        2023-07-25  16000
7        8  Henry  Charles  Geography        2023-08-17  17000
9       10   Jack     Noah        Art        2023-10-05  19000

In [57]:
import pandera as pa
from pandera.typing import Series
from datetime import datetime
import pandas as pd

# define the schema using schema model

class StudentSchema(pa.DataFrameModel):
    roll_no: Series[int] = pa.Field(ge=1)
    name: Series[str] = pa.Field(nullable=False)
    father: Series[str] = pa.Field(nullable=False)
    course: Series[str] = pa.Field(nullable=False)
    date_of_admission: Series[datetime] = pa.Field(le=datetime.now())
    fee: Series[int] = pa.Field(ge=0)
    
    class Config:
        coerce = True     # Automatically coerce types if possible
        strict = True     # Ensure all columns are accounted for in the schema
        
# data for 10 students
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'physics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Physics', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]

# create the dataframe
students_df = pd.DataFrame(students_data)

# convert 'date_of_admission' to datetime
students_df['date_of_admission'] = pd.to_datetime(students_df['date_of_admission'])

# validate the dataframe

validated_df = StudentSchema.validate(students_df)

print(validated_df)

   roll_no    name   father     course date_of_admission    fee
0        1   Alice      Bob    Physics        2023-01-10  10000
1        2   Brian    Steve  Chemistry        2023-02-12  11000
2        3   Chloe      Tim    Biology        2023-03-14  12000
3        4   David     Rick    physics        2023-04-10  13000
4        5     Eva     John    Physics        2023-05-16  14000
5        6   Frank      Tom  Economics        2023-06-21  15000
6        7   Grace    Harry    History        2023-07-25  16000
7        8   Henry  Charles  Geography        2023-08-17  17000
8        9  Isabel   Oliver    English        2023-09-10  18000
9       10    Jack     Noah        Art        2023-10-05  19000

## apply filter on date column

* dataframe.column.dt
* dt.strftime
* dt.strptime

In Pandas, when you have a `datetime` column in a DataFrame, you can format the date and time information using the `strftime` method which allows for flexible formatting by specifyings format codes. Each code represents a different element of the date and time. Below are some of the commonly used format codes that you can use with `strftime`.

```
`%a`- Abbreviated weekday name.
`%A`- Full weekday name.
`%w`- Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
`%d`- Day of the month as a zero-padded decimal number.
`%b`- Abbreviated month name.
`%B`- Full month name.
`%m`- Month as a zero-padded decimal number.
`%y`- Year without century as a zero-padded decimal number.
`%Y`- Year with century as a decimal number.
`%H`- Hour (24-hour clock) as a zero-padded decimal number.
`%I`- Hour (12-hour clock) as a zero-padded decimal number.
`%p`- Locale’s equivalent of either AM or PM.
`%M`- Minute as a zero-padded decimal number.
`%S`- Second as a zero-padded decimal number.
`%f`- Microsecond as a decimal number, zero-padded on the left.
`%z`- UTC offset in the form ±HHMM[SS[.ffffff]] (empty string if the object is naive).
`%Z`- Time zone name (empty string if the object is naive).
`%j`- Day of the year as a zero-padded decimal number.
`%U`- Week number of the year (Sunday as the first day of the week) as a zero-padded decimal number.
`%W`- Week number of the year (Monday as the first day of the week) as a zero-padded decimal number.
`%c`- Locale’s appropriate date and time representation.
`%x`- Locale’s appropriate date representation.
`%X`- Locale’s appropriate time representation.
`%G`- ISO 8601 year with century representing the year that contains the greater part of the ISO week (`%V`).
`%u`- ISO 8601 weekday as a decimal number where 1 is Monday.
`%V`- ISO 8601 week number as a decimal number with Monday as the first day of the week.
```
Here's a small example of how to use `strftime` with a pandas DataFrame.

```
import pandas as pd

# create a sample DataFrame with datetime column

df = pd.DataFrame({
    'datetime': pd.date_range(start='2025-01-01', periods=3, freq='D')
})

# format the `datetime` column as a string with a specific format.

df['formatted_date'] = df['datetime'].dt.strftime('%Y-%m-%d %H-%M-%S')

print(df)
```

The `formatted_date` column will contain string representing the dates in the format specific by the `strftime` method. You can combine any of the symbols above to create the date format string as per your requirements.

In [58]:
students_df['date_of_admission']

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

In [70]:
students_df['date_of_admission'].dt.year
students_df['date_of_admission'].dt.month
students_df['date_of_admission'].dt.day
students_df['date_of_admission'].dt.weekday
students_df['date_of_admission'].dt.day_of_week
students_df['date_of_admission'].dt.hour
students_df['date_of_admission'].dt.minute
students_df['date_of_admission'].dt.second
students_df['date_of_admission'].dt.microsecond
students_df['date_of_admission'].dt.tz
students_df['date_of_admission'].dt.tz_localize
students_df['date_of_admission'].dt.tz_convert
students_df['date_of_admission'].dt.tz_localize(None)

0   2023-01-10
1   2023-02-12
2   2023-03-14
3   2023-04-10
4   2023-05-16
5   2023-06-21
6   2023-07-25
7   2023-08-17
8   2023-09-10
9   2023-10-05
Name: date_of_admission, dtype: datetime64[ns]

In [71]:
[i for i in dir(students_df['date_of_admission'].dt) if '_' not in i]

['ceil',
 'date',
 'day',
 'dayofweek',
 'dayofyear',
 'daysinmonth',
 'floor',
 'freq',
 'hour',
 'isocalendar',
 'microsecond',
 'minute',
 'month',
 'nanosecond',
 'normalize',
 'quarter',
 'round',
 'second',
 'strftime',
 'time',
 'timetz',
 'tz',
 'unit',
 'weekday',
 'year']

In [72]:
from datetime import datetime

date: datetime = datetime.now()

date

datetime.datetime(2025, 6, 21, 2, 30, 19, 75248)

In [75]:
s1: Series = pd.Series([date])

s1

0   2025-06-21 02:30:19.075248
dtype: datetime64[ns]

In [76]:
s1.dt.strftime('%Y/%m $d %I %b %B')    # convert from date to text

0    2025/06 $d 02 Jun June
dtype: object

In [78]:
s2: Series = pd.Series(['01 Nov 2023', '01 Nov 2024', '01 Jan 2025'])

s2

0    01 Nov 2023
1    01 Nov 2024
2    01 Jan 2025
dtype: object

In [ ]:
s2.apply(lambda x: datetime.strptime(x, '%d %b %Y'))    # string to datetime

TypeError: descriptor 'strftime' for 'datetime.date' objects doesn't apply to a 'str' object